Repository: GYFX35/AI-services
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: es

source: Error: WEATHER_API_KEY environment variable not set.
es: Error: La variable de entorno WEATHER_API_KEY no está configurada.

source: Please provide a location.
es: Por favor, proporcione una ubicación.

source: Weather in %(city)s, %(region)s, %(country)s:
es: El tiempo en %(city)s, %(region)s, %(country)s:

source: Temperature: %(temp_c)s°C / %(temp_f)s°F
es: Temperatura: %(temp_c)s°C / %(temp_f)s°F

source: Condition: %(condition)s
es: Condición: %(condition)s

source: Wind: %(wind_mph)s mph
es: Viento: %(wind_mph)s mph

source: Humidity: %(humidity)s%%
es: Humedad: %(humidity)s%%

source: Error fetching weather data: %(error)s
es: Error al obtener los datos del tiempo: %(error)s

source: An unexpected error occurred: %(error)s
es: Ocurrió un error inesperado: %(error)s

source: Guess the Number
es: Adivina el número

source: A simple number guessing game.
es: Un sencillo juego de adivinar el número.

source: I'm thinking of a number between 1 and 100.
es: Estoy pensando en un número entre 1 y 100.

source: Guess
es: Adivinar

source: Please enter a valid number between 1 and 100.
es: Por favor, introduce un número válido entre 1 y 100.

source: Congratulations! You guessed the number in %(attempts)s attempts.
es: ¡Felicidades! Adivinaste el número en %(attempts)s intentos.

source: Too low! Try again.
es: ¡Demasiado bajo! Inténtalo de nuevo.

source: Too high! Try again.
es: ¡Demasiado alto! Inténtalo de nuevo.

source: Here is the generated code for your game.
es: Aquí tienes el código generado para tu juego.

source: To-Do App
es: Aplicación de tareas

source: A simple to-do list application.
es: Una sencilla aplicación de lista de tareas.

source: Add a new task...
es: Añadir una nueva tarea...

source: Add Task
es: Añadir tarea

source: Delete
es: Eliminar

source: Here is the generated code for your app.
es: Aquí tienes el código generado para tu aplicación.

source: Error on line %(line_number)s: Invalid format. Each line must be in 'key: value' format.
es: Error en la línea %(line_number)s: Formato no válido. Cada línea debe tener el formato 'clave: valor'.

source: Error on line %(line_number)s: Indentation error or item outside of a section.
es: Error en la línea %(line_number)s: Error de sangría o elemento fuera de una sección.

source: My Website
es: Mi sitio web

source: Error: Number of images must be between 0 and 10.
es: Error: El número de imágenes debe estar entre 0 y 10.

source: placeholder image %(number)s
es: imagen de marcador de posición %(number)s

source: Error: Invalid number for images. Please use an integer.
es: Error: Número de imágenes no válido. Por favor, use un número entero.

source: Here is the generated code for your website.
es: Aquí tienes el código generado para tu sitio web.

source: Here is the generated code for your Python backend.
es: Aquí está el código generado para su backend de Python.

source: This is a placeholder for an art criticism based on your prompt: %(prompt)s
es: Este es un marcador de posición para una crítica de arte basada en su indicación: %(prompt)s

source: Here is the generated automation script for your task.
es: Aquí está el script de automatización generado para su tarea.

source: Missing <!DOCTYPE html> declaration at the beginning.
es: Falta la declaración <!DOCTYPE html> al principio.

source: Mismatched <html> tags.
es: Etiquetas <html> no coincidentes.

source: Mismatched <head> tags.
es: Etiquetas <head> no coincidentes.

source: Mismatched <body> tags.
es: Etiquetas <body> no coincidentes.

source: Mismatched curly braces {}.
es: Llaves {} no coincidentes.

source: Line %(line_number)s: Missing semicolon ';'.
es: Línea %(line_number)s: Falta el punto y coma ';'.

source: No obvious issues found in your %(lang)s code.
es: No se han encontrado problemas evidentes en tu código %(lang)s.

source: Found potential issues in your %(lang)s code:
es: Se han encontrado posibles problemas en tu código %(lang)s:

source: We're excited to announce %(prompt)s!
es: ¡Estamos encantados de anunciar %(prompt)s!

source: Come and check us out! You won't be disappointed.
es: ¡Ven a visitarnos! No te decepcionará.

source: Error fetching URL: %(error)s
es: Error al obtener la URL: %(error)s

source: Error: Not a valid GitHub URL.
es: Error: No es una URL de GitHub válida.

source: Error: URL does not appear to be a valid GitHub file URL (e.g., .../user/repo/blob/branch/file).
es: Error: La URL no parece ser una URL de archivo de GitHub válida (por ejemplo, .../usuario/repositorio/blob/rama/archivo).

source: Error fetching file from GitHub: %(error)s
es: Error al obtener el archivo de GitHub: %(error)s

source: API key is missing
es: Falta la clave de la API

source: Invalid API key
es: Clave de API no válida

source: Prompt is required
es: El prompt es obligatorio

source: URL is required
es: La URL es obligatoria

source: Location is required
es: La ubicación es obligatoria

source: Text is required
es: El texto es obligatorio

source: Username is required
es: El nombre de usuario es obligatorio

source: Username already exists
es: El nombre de usuario ya existe

source: Title and description are required
es: El título y la descripción son obligatorios

source: Description is required
es: La descripción es obligatoria

source: Could not extract meaningful content from the URL.
es: No se pudo extraer contenido significativo de la URL.

source: Amount and currency are required
es: La cantidad y la moneda son obligatorias

source: Invalid amount
es: Cantidad no válida

source: Services
es: Servicios

source: Verification
es: Verificación

source: Military
es: Militar

source: Purchase
es: Compra

source: Portfolio
es: Portafolio

source: Contact
es: Contacto

source: Sponsor
es: Patrocinar

source: Automation Capacity
es: Capacidad de automatización

source: We can generate automation scripts to handle your repetitive tasks.
es: Podemos generar scripts de automatización para manejar sus tareas repetitivas.

source: Sciences Educator
es: Educador de Ciencias

source: Our AI can provide science education and resolve exercises in mathematics, physics-chemistry, biology, geography, and astronomy.
es: Nuestra IA puede proporcionar educación científica y resolver ejercicios de matemáticas, física-química, biología, geografía y astronomía.

source: Music Instrumentalist Player
es: Músico Instrumentalista

source: Our AI can provide musical suggestions, help with learning an instrument, and compose short musical pieces.
es: Nuestra IA puede proporcionar sugerencias musicales, ayudar a aprender un instrumento y componer piezas musicales cortas.

source: Investigation Role
es: Rol de Investigación

source: Expert cybersecurity and global security investigator for FBI, CIA, and IA, focusing on data protection.
es: Investigador experto en ciberseguridad y seguridad global para el FBI, la CIA y la IA, centrado en la protección de datos.

source: Military Services Assistance
es: Asistencia de Servicios Militares

source: Strategic assistance for armies and security services, including tactical planning and risk assessment.
es: Asistencia estratégica para ejércitos y servicios de seguridad, incluyendo planificación táctica y evaluación de riesgos.

source: Podcast & Business Podcast Role
es: Rol de Podcast y Podcast de Negocios

source: Expert podcast producer, creator, and designer for high-quality podcasts, specializing in business.
es: Productor, creador y diseñador experto de podcasts de alta calidad, especializado en negocios.

source: Supply Chain Consultant
es: Consultor de Cadena de Suministro

source: Expert consultant for optimizing supply chain strategy, inventory management, and sourcing.
es: Consultor experto para la optimización de la estrategia de la cadena de suministro, la gestión de inventarios y el abastecimiento.

source: Logistics & Transportation Specialist
es: Especialista en Logística y Transporte

source: Professional specialist for managing goods movement, route optimization, and international logistics.
es: Especialista profesional para la gestión del movimiento de mercancías, la optimización de rutas y la logística internacional.

source: Data Engineering Expert
es: Experto en Ingeniería de Datos

source: Expert data engineer for designing, building, and maintaining robust data pipelines and architectures.
es: Ingeniero de datos experto para el diseño, construcción y mantenimiento de tuberías de datos y arquitecturas robustas.

source: Incoterms Expert
es: Experto en Incoterms

source: Professional expert for guidance and clarification on international commercial terms (Incoterms).
es: Experto profesional para el asesoramiento y aclaración sobre términos comerciales internacionales (Incoterms).

source: Fintech & Banking Strategist
es: Estratega de Fintech y Banca

source: Expert assistance for banks, fintechs, and VC firms, focusing on data development, scale, and security.
es: Asistencia experta para bancos, fintechs y firmas de VC, con un enfoque en el desarrollo de datos, escala y seguridad.

source: Computer Vision Specialist
es: Especialista en Visión Artificial

source: Expert in image and video analysis, deep learning for vision, and real-world vision applications.
es: Experto en análisis de imagen y vídeo, aprendizaje profundo para visión y aplicaciones de visión en el mundo real.

source: IA Researcher
es: Investigador de IA

source: Expert AI researcher providing insights into state-of-the-art research, methodology, and future directions.
es: Investigador experto en IA que ofrece información sobre investigación de vanguardia, metodología y direcciones futuras.

source: eSports Development & Assistance
es: Desarrollo y Asistencia de eSports

source: Expert assistance for eSports development, team management, tournament organization, and performance optimization.
es: Asistencia experta para el desarrollo de eSports, gestión de equipos, organización de torneos y optimización del rendimiento.

source: AI Dermatology Specialist
es: Especialista en Dermatología IA

source: Expert assistance for skin conditions, treatments, and dermatological procedures, providing professional guidance.
es: Asistencia experta para afecciones de la piel, tratamientos y procedimientos dermatológicos, proporcionando orientación profesional.

source: Submit
es: Enviar

source: Dermatology & Skincare Support
es: Soporte de Dermatología y Cuidado de la Piel

source: Enter your request for skin condition information, treatment guidance, or skincare product analysis below.
es: Ingrese su solicitud de información sobre afecciones de la piel, guía de tratamiento o análisis de productos para el cuidado de la piel a continuación.

source: Your dermatology request
es: Su solicitud de dermatología

source: eSports Strategic Support
es: Soporte Estratégico de eSports

source: Enter your request for eSports team management, tournament planning, or performance analysis below.
es: Ingrese su solicitud de gestión de equipos de eSports, planificación de torneos o análisis de rendimiento a continuación.

source: Your eSports request
es: Su solicitud de eSports

source: Computer Vision Guidance
es: Guía de Visión Artificial

source: Enter your request for image analysis, object detection, or vision model deployment below.
es: Ingrese su solicitud de análisis de imágenes, detección de objetos o implementación de modelos de visión a continuación.

source: Your computer vision request
es: Su solicitud de visión artificial

source: AI Research Support
es: Soporte de Investigación de IA

source: Enter your request for AI research insights, methodology, or ethical impact discussion below.
es: Ingrese su solicitud de conocimientos de investigación de IA, metodología o discusión sobre el impacto ético a continuación.

source: Your AI research request
es: Su solicitud de investigación de IA

source: Fintech, VC & Data Security Support
es: Soporte para Fintech, VC y Seguridad de Datos

source: Enter your request for fintech consulting, VC strategy, data scaling, or security guidance.
es: Ingrese su solicitud de consultoría fintech, estrategia de VC, escalado de datos o guía de seguridad.

source: Your fintech request
es: Su solicitud de fintech

source: Optimize Your Supply Chain
es: Optimice su Cadena de Suministro

source: Enter your supply chain strategy, inventory, or sourcing request below.
es: Ingrese su estrategia de cadena de suministro, inventario o solicitud de abastecimiento a continuación.

source: Your supply chain request
es: Su solicitud de cadena de suministro

source: Manage Logistics & Transportation
es: Gestionar Logística y Transporte

source: Enter your logistics, route optimization, or shipping request below.
es: Ingrese su solicitud de logística, optimización de rutas o envío a continuación.

source: Your logistics request
es: Su solicitud de logística

source: Design & Build Data Pipelines
es: Diseñar y Construir Tuberías de Datos

source: Enter your data engineering, pipeline design, or architecture request below.
es: Ingrese su solicitud de ingeniería de datos, diseño de tuberías o arquitectura a continuación.

source: Your data engineering request
es: Su solicitud de ingeniería de datos

source: Get Guidance on Incoterms
es: Obtenga Asesoramiento sobre Incoterms

source: Enter your Incoterms or international trade request below.
es: Ingrese su solicitud de Incoterms o comercio internacional a continuación.

source: Your Incoterms request
es: Su solicitud de Incoterms

source: Global Translator
es: Traductor Global

source: Translate Text to Any Language
es: Traducir texto a cualquier idioma

source: Enter the text you want to translate and the target language.
es: Introduce el texto que quieres traducir y el idioma de destino.

source: Text to translate
es: Texto a traducir

source: Target Language (e.g., Spanish, French, Japanese)
es: Idioma de destino (por ejemplo, español, francés, japonés)

source: Translate
es: Traducir

source: Create, Perfect & Design Your Podcast
es: Crea, Perfecciona y Diseña Tu Podcast

source: Enter your podcast creation, perfection, or design request below.
es: Ingrese su solicitud de creación, perfeccionamiento o diseño de podcast a continuación.

source: Your podcast request
es: Tu solicitud de podcast

source: Tactical Planning & Security Strategy
es: Planificación Táctica y Estrategia de Seguridad

source: Enter your request for military or security services assistance below.
es: Introduce tu solicitud de asistencia para servicios militares o de seguridad a continuación.

source: Your military assistance request
es: Tu solicitud de asistencia militar

source: Cybersecurity & Global Security Investigation
es: Investigación de Ciberseguridad y Seguridad Global

source: Enter your security investigation or data protection request below.
es: Introduzca su solicitud de investigación de seguridad o protección de datos a continuación.

source: Your investigation request
es: Su solicitud de investigación

source: Business Plan Creator
es: Creador de Planes de Negocio

source: Create, perfect, and develop your business plan
es: Crea, perfecciona y desarrolla tu plan de negocio

source: Enter your request for business plan assistance below.
es: Introduce tu solicitud de asistencia para el plan de negocio a continuación.

source: Your business plan request
es: Tu solicitud de plan de negocio

source: Document Specialist
es: Especialista en Documentos

source: Write, scan, and build documents
es: Escribir, escanear y crear documentos

source: Enter your request for ebooks, articles, PDFs, or DOCs below.
es: Introduce tu solicitud para ebooks, artículos, PDFs o DOCs a continuación.

source: Your document request
es: Tu solicitud de documento

source: Geometry Assistant
es: Asistente de Geometría

source: Get help with geometry problems
es: Obtén ayuda con problemas de geometría

source: Enter your geometry question or problem below.
es: Introduce tu pregunta o problema de geometría a continuación.

source: Your geometry question
es: Tu pregunta de geometría

source: Cartography Assistant
es: Asistente de Cartografía

source: Get help with maps and cartography
es: Obtén ayuda con mapas y cartografía

source: Enter your cartography or GIS question below.
es: Introduce tu pregunta de cartografía o SIG a continuación.

source: Your cartography question
es: Tu pregunta de cartografía

source: Get musical assistance or compositions
es: Obtén asistencia musical o composiciones

source: Enter your musical request below.
es: Introduce tu solicitud musical a continuación.

source: Your musical request
es: Tu solicitud musical

source: Ask a question or submit an exercise
es: Haz una pregunta o envía un ejercicio

source: Enter your question or exercise below.
es: Introduce tu pregunta o ejercicio a continuación.

source: Your question or exercise
es: Tu pregunta o ejercicio

source: Create a New Project
es: Crear un Nuevo Proyecto

source: Project Details
es: Detalles del Proyecto

source: Enter the title and description for your new project.
es: Introduce el título y la descripción de tu nuevo proyecto.

source: Project Title
es: Título del Proyecto

source: Project Description
es: Descripción del Proyecto

source: Create Project
es: Crear Proyecto

source: Promote Your Startup
es: Promociona tu Startup

source: Startup Details
es: Detalles de la Startup

source: Enter a description of your startup to generate a promotion.
es: Introduce una descripción de tu startup para generar una promoción.

source: Startup Description
es: Descripción de la Startup

source: Generate Promotion
es: Generar Promoción

source: Sponsor us on GitHub
es: Patrocínanos en GitHub

source: Sponsor us via Stripe
es: Patrocínanos vía Stripe
